http-benchmarks/output/run-httpserv_go-35000-1000.txt
Running 1m test @ http://localhost:8080
  24 threads and 1000 connections
  Thread calibration: mean lat.: 450.947ms, rate sampling interval: 1841ms
  Thread calibration: mean lat.: 418.216ms, rate sampling interval: 1921ms
  Thread calibration: mean lat.: 431.846ms, rate sampling interval: 1981ms
  Thread calibration: mean lat.: 453.776ms, rate sampling interval: 1935ms
  Thread calibration: mean lat.: 369.364ms, rate sampling interval: 1856ms
  Thread calibration: mean lat.: 482.501ms, rate sampling interval: 2037ms
  Thread calibration: mean lat.: 453.419ms, rate sampling interval: 1959ms
  Thread calibration: mean lat.: 474.028ms, rate sampling interval: 2030ms
  Thread calibration: mean lat.: 439.174ms, rate sampling interval: 2004ms
  Thread calibration: mean lat.: 440.349ms, rate sampling interval: 1939ms
  Thread calibration: mean lat.: 430.513ms, rate sampling interval: 1950ms
  Thread calibration: mean lat.: 451.867ms, rate sampling interval: 2060ms
  Thread calibration: mean lat.: 430.163ms, rate sampling interval: 2008ms
  Thread calibration: mean lat.: 434.307ms, rate sampling interval: 1955ms
  Thread calibration: mean lat.: 441.780ms, rate sampling interval: 1939ms
  Thread calibration: mean lat.: 412.358ms, rate sampling interval: 1905ms
  Thread calibration: mean lat.: 403.744ms, rate sampling interval: 1869ms
  Thread calibration: mean lat.: 429.828ms, rate sampling interval: 1936ms
  Thread calibration: mean lat.: 391.453ms, rate sampling interval: 1842ms
  Thread calibration: mean lat.: 389.690ms, rate sampling interval: 1869ms
  Thread calibration: mean lat.: 393.969ms, rate sampling interval: 1861ms
  Thread calibration: mean lat.: 342.392ms, rate sampling interval: 1838ms
  Thread calibration: mean lat.: 373.761ms, rate sampling interval: 1880ms
  Thread calibration: mean lat.: 364.698ms, rate sampling interval: 1772ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.45s     1.76s    8.13s    61.00%
    Req/Sec     1.31k    15.92     1.38k    78.52%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    3.30s 
 75.000%    4.80s 
 90.000%    5.98s 
 99.000%    7.27s 
 99.900%    7.73s 
 99.990%    7.92s 
 99.999%    8.08s 
100.000%    8.13s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      99.711     0.000000            1         1.00
    1275.903     0.100000       156736         1.11
    1703.935     0.200000       313240         1.25
    2224.127     0.300000       469745         1.43
    2756.607     0.400000       626305         1.67
    3303.423     0.500000       782818         2.00
    3581.951     0.550000       860828         2.22
    3864.575     0.600000       939308         2.50
    4149.247     0.650000      1017408         2.86
    4468.735     0.700000      1095976         3.33
    4804.607     0.750000      1174164         4.00
    4972.543     0.775000      1213398         4.44
    5156.863     0.800000      1251982         5.00
    5349.375     0.825000      1291475         5.71
    5545.983     0.850000      1330576         6.67
    5746.687     0.875000      1369264         8.00
    5861.375     0.887500      1389157         8.89
    5980.159     0.900000      1408683        10.00
    6103.039     0.912500      1427942        11.43
    6230.015     0.925000      1447521        13.33
    6369.279     0.937500      1466985        16.00
    6443.007     0.943750      1476844        17.78
    6524.927     0.950000      1486981        20.00
    6606.847     0.956250      1496503        22.86
    6696.959     0.962500      1506198        26.67
    6795.263     0.968750      1515894        32.00
    6852.607     0.971875      1521049        35.56
    6905.855     0.975000      1525683        40.00
    6967.295     0.978125      1530804        45.71
    7032.831     0.981250      1535576        53.33
    7110.655     0.984375      1540572        64.00
    7151.615     0.985938      1542976        71.11
    7192.575     0.987500      1545259        80.00
    7237.631     0.989062      1547664        91.43
    7286.783     0.990625      1550128       106.67
    7340.031     0.992188      1552648       128.00
    7364.607     0.992969      1553863       142.22
    7393.279     0.993750      1555032       160.00
    7426.047     0.994531      1556246       182.86
    7467.007     0.995313      1557568       213.33
    7503.871     0.996094      1558750       256.00
    7524.351     0.996484      1559343       284.44
    7544.831     0.996875      1559896       320.00
    7573.503     0.997266      1560560       365.71
    7598.079     0.997656      1561120       426.67
    7630.847     0.998047      1561787       512.00
    7647.231     0.998242      1562060       568.89
    7663.615     0.998437      1562360       640.00
    7679.999     0.998633      1562658       731.43
    7700.479     0.998828      1562973       853.33
    7725.055     0.999023      1563261      1024.00
    7737.343     0.999121      1563411      1137.78
    7753.727     0.999219      1563586      1280.00
    7770.111     0.999316      1563739      1462.86
    7786.495     0.999414      1563873      1706.67
    7802.879     0.999512      1564013      2048.00
    7815.167     0.999561      1564089      2275.56
    7827.455     0.999609      1564193      2560.00
    7835.647     0.999658      1564243      2925.71
    7847.935     0.999707      1564318      3413.33
    7864.319     0.999756      1564408      4096.00
    7872.511     0.999780      1564438      4551.11
    7880.703     0.999805      1564472      5120.00
    7888.895     0.999829      1564510      5851.43
    7901.183     0.999854      1564552      6826.67
    7913.471     0.999878      1564597      8192.00
    7917.567     0.999890      1564613      9102.22
    7921.663     0.999902      1564627     10240.00
    7929.855     0.999915      1564644     11702.86
    7938.047     0.999927      1564663     13653.33
    7950.335     0.999939      1564682     16384.00
    7958.527     0.999945      1564694     18204.44
    7962.623     0.999951      1564700     20480.00
    7970.815     0.999957      1564711     23405.71
    7979.007     0.999963      1564723     27306.67
    7991.295     0.999969      1564730     32768.00
    8003.583     0.999973      1564734     36408.89
    8011.775     0.999976      1564739     40960.00
    8019.967     0.999979      1564743     46811.43
    8036.351     0.999982      1564748     54613.33
    8048.639     0.999985      1564753     65536.00
    8065.023     0.999986      1564755     72817.78
    8073.215     0.999988      1564758     81920.00
    8081.407     0.999989      1564760     93622.86
    8093.695     0.999991      1564762    109226.67
    8101.887     0.999992      1564766    131072.00
    8101.887     0.999993      1564766    145635.56
    8105.983     0.999994      1564769    163840.00
    8105.983     0.999995      1564769    187245.71
    8105.983     0.999995      1564769    218453.33
    8110.079     0.999996      1564771    262144.00
    8110.079     0.999997      1564771    291271.11
    8114.175     0.999997      1564772    327680.00
    8114.175     0.999997      1564772    374491.43
    8118.271     0.999998      1564774    436906.67
    8118.271     0.999998      1564774    524288.00
    8118.271     0.999998      1564774    582542.22
    8118.271     0.999998      1564774    655360.00
    8118.271     0.999999      1564774    748982.86
    8130.559     0.999999      1564775    873813.33
    8130.559     0.999999      1564775   1048576.00
    8130.559     0.999999      1564775   1165084.44
    8130.559     0.999999      1564775   1310720.00
    8130.559     0.999999      1564775   1497965.71
    8134.655     0.999999      1564776   1747626.67
    8134.655     1.000000      1564776          inf
#[Mean    =     3452.808, StdDeviation   =     1761.328]
#[Max     =     8130.560, Total count    =      1564776]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1883746 requests in 1.00m, 3.84GB read
Requests/sec:  31397.36
Transfer/sec:     65.57MB

JSON Output:
{
	"requests": 1883746,
	"duration_in_microseconds": 59996957.00,
	"bytes": 4125403740,
	"requests_per_sec": 31397.36,
	"bytes_transfer_per_sec": 68760216.29,
	"latency_distribution": [
		{
			"percentile": 50,
			"latency_in_microseconds": 3303423
		},
		{
			"percentile": 75,
			"latency_in_microseconds": 4804607
		},
		{
			"percentile": 90,
			"latency_in_microseconds": 5980159
		},
		{
			"percentile": 99,
			"latency_in_microseconds": 7270399
		},
		{
			"percentile": 99.9,
			"latency_in_microseconds": 7725055
		},
		{
			"percentile": 99.99,
			"latency_in_microseconds": 7921663
		},
		{
			"percentile": 99.999,
			"latency_in_microseconds": 8081407
		},
		{
			"percentile": 100,
			"latency_in_microseconds": 8134655
		}
	]
}